src/Catalogs/ПечатныеФормы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>ПечатныеФормы</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПечатнаяФормаПоУмолчанию</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПечатныеФормы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПодключенныеФормы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Макет</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Процедура</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/ПечатныеФормы/Forms/ФормаГруппы/module.bsl
Процедура ПередОткрытием(Отказ, СтандартнаяОбработка)
	Отказ = ЭтоНовый();
КонецПроцедуры

Процедура ПриОткрытии()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ПечатныеФормы.Ссылка
	|ИЗ
	|	Справочник.ПечатныеФормы КАК ПечатныеФормы
	|ГДЕ
	|	ПечатныеФормы.Родитель = &Родитель
	|	И не ПечатныеФормы.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Родитель",Ссылка);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		ЭлементыФормы.ПечатнаяФормаПоУмолчанию.СписокВыбора.Добавить(Выборка.Ссылка);
	КонецЦикла;

КонецПроцедуры
